Revit 2027 API
PipeFittingAndAccessoryPressureDropUIDataItem.GetPipeFittingAndAccessoryData Method
 Gets the fitting data stored in the UI data item.
Namespace: Autodesk.Revit.UI.Plumbing
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PipeFittingAndAccessoryData GetPipeFittingAndAccessoryData()
Public Function GetPipeFittingAndAccessoryData As PipeFittingAndAccessoryData
public:
PipeFittingAndAccessoryData^ GetPipeFittingAndAccessoryData()
member GetPipeFittingAndAccessoryData : unit -> PipeFittingAndAccessoryData
Return Value
PipeFittingAndAccessoryData
 The fitting data stored in the UI data item.
See Also
Reference
PipeFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Plumbing Namespace